// 1 - устанавливаем библиотеку redux и react-redux
// 2 - в файле индекс устанавливаем(импортируем) провайдер и обгортаем (Provider store={store}) в него app
// 3 - создаем папку редакс куда поместим все касательно редакс.
// 4 - В ней файл индекс, который служит только для експорта всего, что лежит в редаксе
// 5 - Створюємо кореневу річь - store.js с експортом createStore який приймає reducer
// 6 - reduser - реагує на dispatch
// 7 - створюємо reduser що приймає (state = initialState, action)
// 8 - описуємо switch case
// 9 - щоб прокинути store в app робимо експорт в редакс индекс
// 10- копіюємо (затягуємо) урлу постс із джплейсхолдер в редюсер
//    а) створюємо пустий масив пост
//    б) створюємо щось що буде відображатись під час завантаження сторінки
//    в) описуємо сценарій в кейсах
//    г) щоб перевірить чи працює сторе створюємо компоненту постс в апп.дж
// 11- щоб в апп отримати дані зі стору треба використати селектор з бібліотеки реакт-редакс
// 12- імпорт реакт в апп
// 13- виведем в консоль перевірку стор
// 14- переходим на апп і зтягнем дані з джплейсхолдер через React.useEffect
//     а) описуємо асинхронну фунцію (приклад fetchPosts
//     б) щоб try не давала помилку треба зробити кетч-блок
//     в) цю функцію запустим в юзефект один раз (пустив масив)
//     г) щоб донести дані в редюсер імпортуємо юзДиспатч, і створюємо контс діспатч
// 15- в діспатч відоражаємо type і кейси + payload,
// 16- передаєм екшн в редюсер
// 17- в апп відмальовуємо пости в див (змінили юзселектор
//     в див мапуємо пости
// 18- щоб під час загрузки відображалось щось а не білий екран в try додамо діспатч isLoading
//       і після юзефект тернаркой пропишем иф ретьорн (кондішнл-рендерінг)
// 19- зробимо чет еррор, поклавши в пейлоад строку, error додаємо в селектор
//       тернаркой виведем в апп на екран ерор
// !!!!!!
//     dispatch так не описують!
//     1 - робимо файлик actionTypes і робимо константи на всі кейси і в кейсах передаємо констант та імпортувати їх
//         в редюсер а потім через експорт індекс джс і потім імпорт і апп

    // 2 - створюємо файл екшн креейтор і перенесем туди з апп діспатч, щоб можна було одну дію виконувати по різному в двох місцях
    // 3 - в діспатч тепер кладемо не обїест а просто виклик фунції,

// коміт хук щоб модернізувати і винести в окрему

// 1 - створюємо в апп usePostsFetcher фунція
//
// !!!!!!!!!!!
    // далі приклад фінального редакса якщо багато редюсерів - різні папки з індекс і об"єднати разом через фунцію combineReducer